# -*- coding: utf-8 -*-

'''

 @Time : 2020/3/29 23:32
 @Author : SharonTong

'''

class DailyParam():
    #startdate 每月改一次，enddate每天改一次，当天的前一天
    startdate   = '20200301'
    enddate     = '20200330'
    month_id    = '202002'

    key_order   = ['省份', '地市', '品牌', '子类', '规格', '焦油含量', '规格周长', '包装支数', '价类', '含税调拨价', '原统一批发价', '统一批发价', '建议零售价', \
                    '所属工业', '2020年累销', '2019年累销', '2020年累销售额', '2020年原价格累销售额', '2019年累销售额', '2019年原价格累销售额', '当日销量', \
                    '当月销量', '同期当月销量', '上月销量', '库存', '同期库存']     #年份每年一改

    filename    = r'D:/'+enddate[0:4]+'年'+enddate[4:6]+'月各规格各地市销售明细表('+enddate[4:6]+'月'+enddate[6:]+'日).xlsx'

    title       = r'各规格各地市销售明细表'

